Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: གཟུགས་བརྙན་ཉིད་མེད་པའི་ཕྱིར་རོ། །
en: because reflections themselves are nonexistent.

source: ཆོས་ཐམས་ཅད་ནི་མིང་མེད་མཚན་མ་མེད་དེ།
en: Mental phenomena are nameless and without marks,

source: མིང་དང་མཚན་མ་མེད་པའི་ཕྱིར་རོ། །
en: because names and marks are nonexistent.

source: ཆོས་ཐམས་ཅད་ནི་བྲག་ཅ་ལྟ་བུ་སྟེ།
en: Mental phenomena are like echoes,

source: ཡང་དག་པ་མ་ཡིན་པ་ལས་བྱུང་བས་ཅི་ཡང་མེད་པའི་ཕྱིར་རོ། །
en: because they are nonexistent, arisen out of falsity.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པ་སྟེ།
en: Mental phenomena are devoid of intrinsic nature,

source: རང་བཞིན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because their nature is unobservable.

source: ཆོས་ཐམས་ཅད་ནི་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ།
en: Mental phenomena are like mirages,

source: ཅི་ཡང་མེད་པར་ཤེས་པའི་ཕྱིར་རོ། །
en: because they are understood to be nonexistent.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་རྟོག་ན་
en: “When bodhisattvas contemplate mental phenomena in this manner,

source: ཆོས་ཐམས་ཅད་ལ་མཚན་ཉིད་གཅིག་པའམ་མཚན་ཉིད་ཐ་དད་པར་མི་མཐོང་།
en: they will not see mental phenomena as having the characteristics of being single or multiple.

source: ཆོས་དང་ཆོས་ལྷན་ཅིག་པའམ་སོ་སོ་བར་མི་མཐོང་།
en: They will not see mental phenomena as conjoined or separate.

source: ཆོས་ལ་ཆོས་གནས་པར་ཡང་མི་མཐོང་སྟེ།
en: They will not see mental phenomena as present in mental phenomena.

source: དེ་ལྟར་རྟོག་ན་ཆོས་ཐམས་ཅད་གཞན་ནས་འོངས་པར་ཡང་མི་མཐོང་ངོ་། །
en: When they contemplate this, they will not see mental phenomena as coming from elsewhere.

source: ཆོས་ཐམས་ཅད་ལ་གནས་པའི་གནས་ཡོད་པར་ཡང་མི་མཐོང་ངོ་། །
en: They will not see any mental phenomenon with a foundational basis.

source: ཆོས་ཐམས་ཅད་ལ་གནས་མེད། རྟེན་མེད། བྱུང་བ་མེད་དེ།
en: Mental phenomena lack any foundation, any basis, and any source.

source: ཆོས་ཐམས་ཅད་གནས་མེད་པ་ནི་རྟེན་མེད་པ་གནས་མེད་པའི་ཕྱིར་རོ། །དམིགས་པའི་གནས་མེད་པའི་ཕྱིར་རོ། །
en: Mental phenomena have no foundation, because they lack any basis or locus, and because they lack any observable locus.

source: འཇིག་རྟེན་འཛིན་ཆོས་ཐམས་ཅད་ལ་བྱེ་བྲག་མེད་པ་ནི་ཆོས་ཐམས་ཅད་བྱེ་བྲག་ཏུ་དབྱེ་བའི་མཚན་མ་མེད་དེ།
en: “Lokadhara, mental phenomena are beyond distinction, for they lack any marks to distinguish them.

source: རྐྱེན་མང་པོ་ལས་སྐྱེས་པས་ཕྱིན་ཅི་ལོག་ཏུ་བྱ་བ་ཡོད་ཀྱང་ཆོས་ཐམས་ཅད་ནི་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་སོ། །
en: Because they are born from many conditions, they function due to mistaken perception, yet mental phenomena do not exist in any location or direction.

source: མཁས་པ་དག་ནི་ཆོས་ཐམས་ཅད་ལ་མཚན་ཉིད་གཅིག་པ་ཡང་མ་ཡིན། མཚན་ཉིད་གཉིས་སུ་ཡོད་པ་ཡང་མ་ཡིན། ཐ་དད་པའི་མཚན་ཉིད་དུ་ཡང་མ་ཡིན་པར་དམིགས་སོ། །
en: The wise observe mental phenomena as having neither a single characteristic, nor two characteristics, nor multifarious characteristics.

source: འཇིག་རྟེན་འཛིན་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ། མ་བྱས་པ། མ་བྱུང་བ། བྱས་པ་མེད་པ་སྟེ།
en: Lokadhara, mental phenomena are unborn, uncreated, unarisen, and unfabricated.

source: ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་དང་བྲལ་བ། ངོ་བོ་ཉིད་མེད་པ་སྟེ། རང་བཞིན་ལས་འདས་པའི་ཕྱིར་རོ། །
en: Mental phenomena have no nature or essence, for they are beyond any nature.

source: ཆོས་ཐམས་ཅད་གནས་མེད་པ་ནི་ཕྱིན་པའི་གནས་མེད་པའི་ཕྱིར་རོ། །
en: Mental phenomena are nonabiding, because they are beyond having a destination.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་རྟོག་པ་ན་
en: When they contemplate mental phenomena in this manner,

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་གང་ཟག་མེད་པར་ལེགས་པར་ཆུད་ཅིང་རྟོགས་སོ། །
en: they understand and realize how mental phenomena are without self and without person.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དུ་རྟོགས་སོ། །
en: They will understand mental phenomena to be naturally empty.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་རྟོགས་པས་ན་
en: By understanding mental phenomena to be emptiness,

source: ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པར་རྟོགས་སོ། །
en: they will understand mental phenomena to be without marks.

source: མཚན་མ་མེད་པར་བལྟ་བས་
en: By viewing them as having no marks,

source: ཆོས་ཐམས་ཅད་ལ་སྨོན་པ་མི་འབྱུང་སྟེ།
en: they will have no wishes regarding any mental phenomena.

source: དེའི་ཚེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ཉིད་དུ་རྟོགས་པས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When they realize mental phenomena to be unborn, they will think,

source: འདི་ལ་ཡང་དག་པར་ཆོས་གང་ཡང་སྐྱེ་བའམ་འགོག་པ་མེད་པར་སེམས་སོ། །
en: ‘There are certainly no mental phenomena here that arise or cease.’

source: དེ་ལྟར་རྟོག་པའི་ཚེ་སེམས་རྩེ་གཅིག་ཏུ་གནས་པས་ན་དེ་ཉིད་ཀྱིས་ན་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་ཅིང་
en: When they contemplate this, their minds will rest one-pointedly. In this way, they will understand how mental phenomena are unborn.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཀུན་འབྱུང་དང་འགོག་པ་ཟད་པ་ཡང་མཐོང་ཞིང་ཤེས་སོ། །
en: They will see and understand the exhaustion of the origination and cessation of all mental phenomena.

source: ཆོས་ཐམས་ཅད་མཚན་མ་དང་བྲལ་རང་བཞིན་དང་བྲལ་བར་ཡང་རྟོགས་སོ། །
en: They will understand how mental phenomena are without marks and without intrinsic nature.

source: འཇིག་རྟེན་འཛིན་ཆོས་ཐམས་ཅད་ལ་ངེས་པའི་མཚན་ཉིད་མེད་པས་ན་
en: Lokadhara, because mental phenomena lack true characteristics,

source: ཆོས་ཐམས་ཅད་མཚན་མ་མེད་ཅིང་མཚན་མ་དང་བྲལ་བར་ཁོང་དུ་ཆུད་དོ། །
en: they will understand how mental phenomena are without marks and free from marks.

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་རྟོག་པ་ལ་རྣལ་འབྱོར་པ་ཞེས་བྱའོ། །
en: “Lokadhara, this is how bodhisattva great beings practice the contemplation of mental phenomena in relation to mental phenomena.

source: དེ་ལྟར་རྟོགས་པ་ནི་ཆོས་ལ་དམིགས་པ་མེད། ལེན་པ་མེད་དེ།
en: As for this understanding, they do not observe or appropriate any mental phenomena.

source: ཆོས་ལ་སྐྱེད་པར་མི་བྱེད། གནས་པར་མི་བྱེད། འགོག་པར་མི་བྱེད་པར་ནན་ཏན་བྱེད་དེ།
en: They exert themselves so as not to generate, dwell on, or stop mental phenomena.

source: དེས་ཆོས་ཐམས་ཅད་ཀྱི་མི་འགོག་པ་ཟད་པའི་མཚན་ཉིད་དང་རབ་ཏུ་ཞི་བའི་མཚན་ཉིད་ཀྱང་མཐོང་ངོ་། །
en: They see the characteristic of exhaustion and cessation of all mental phenomena, and their characteristic of pacification.”

source: འཇིག་རྟེན་འཛིན་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་ཤིན་ཏུ་རྟོགས་པ་ཞེས་བྱའོ། །
en: “Lokadhara, this is the bodhisattva great beings’ complete understanding of the four applications of mindfulness.

source: ཅིའི་ཕྱིར་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱ་ཞེ་ན།
en: Why are they called applications of mindfulness ?

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་གཞིག་པའི་གནས་མེད། འབྱུང་བའི་གནས་མེད། གནས་པའི་གནས་མེད་པར་དེ་ལྟར་འཇུག་ན་ཆོས་ཐམས་ཅད་ལ་དྲན་པ་མི་ཉམས་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: The application of mindfulness understands all phenomena as lacking any basis for ceasing, any basis for occurring, and any basis for abiding. When this occurs, it is called unflagging mindfulness or the application of mindfulness with regard to all phenomena.

source: གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པའི་ཆོས་ཐམས་ཅད་ནི་མི་གནས་པ་དང་། མ་སྐྱེས་པ་དང་། མི་ལེན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཤིང་མཐོང་བའི་དོན་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱའོ། །
en: Moreover, the application of mindfulness means understanding and seeing all phenomena accurately as being nonabiding, unborn, and unappropriated.”

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་དྲུག་གོ།། །།
en: This was the sixth chapter:“ The Four Applications of Mindfulness .”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དབང་པོ་རྣམས་ལ་མཁས་པ་ཞེ་ན།
en: “Lokadhara, how are bodhisattva great beings skilled in the five powers?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་ལ་ཡང་དག་པར་རྟོག་གོ། །
en: Bodhisattva great beings accurately contemplate the five transcendent powers.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these five?

source: དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོའོ། །
en: The powers of faith, diligence, mindfulness, absorption, and insight.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དབང་པོ་ལྔ་པོ་ལ་རྣལ་འབྱོར་དུ་སྤྱོད་པ་ན་
en: “When bodhisattvas put the five powers into practice,

source: ཆོས་ཐམས་ཅད་རྟེན་ཅིང་འབྲེལ་ཏེ་བྱུང་བ་ལས་སྐྱེས་ཤིང་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་རྐྱེན་ལས་འདུས་པས་མེ་མགལ་བསྐོར་བ་ལྟ་བུའམ་རྨི་ལམ་གྱི་རང་བཞིན་ལྟ་བུར་ཡིད་ཆེས་སོ། །
en: they gain trust in how all phenomena are born from dependent origination, arise through mistaken perception, and are like a whirling firebrand or a dream, in owing their existence to a gathering of conditions of false perception.

source: ཆོས་ཐམས་ཅད་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། མི་གཙང་བ་དང་། བདག་མེད་པ་དང་། ཟུག་རྔུ་ལྟ་བུ་དང་། ཤུ་བ་ལྟ་བུ་སྟེ་སྙིང་པོ་མེད་པ། མི་བརྟན་པ། འགྱུར་ཞིང་འཇིག་པའི་མཚན་ཉིད་དུ་ཡིད་ཆེས་སོ། །
en: They trust that all phenomena have the characteristics of being impermanent, suffering, impure, selfless, like a thorn or blister, insubstantial, unstable, mutable, and destructible.

source: གཞན་ཡང་ཆོས་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པས་ཅི་ཡང་མེད་པ་སྟེ།
en: Moreover, they trust that all phenomena are false, and thus nonexistent;

source: ཁུ་ཚུར་སྟོང་པའམ། ཁ་དོག་སྡུག་གུ་སྣ་ཚོགས་ཀྱིས་བྱིས་པ་ཆུང་ངུ་བྲིད་པ་ལྟ་བུར་རྣམ་པར་བརྟགས་པ་ལས་བྱུང་བ་ལྟོས་པ་ལས་ཡོད་པ་ཙམ་དུ་ཟད་པས་དངོས་པོར་ངེས་པའི་ཆོས་སུ་གཅིག་ཙམ་ཡང་མེད་པར་ཡིད་ཆེས་སོ། །
en: that just as a child is fooled by an empty fist or a rainbow, phenomena are merely arisen from imputation and dependent phenomena, and thus lack even a single true quality of being an entity.

source: གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་འདས་པ་མ་ཡིན། མ་འོངས་པ་མ་ཡིན། ད་ལྟར་གྱི་མ་ཡིན་པར་ཡིད་ཆེས་སོ། །
en: Moreover, they trust that all phenomena are neither past, present, nor future.

source: ཆོས་ཐམས་ཅད་གང་ནས་ཀྱང་མ་འོངས་ལ་གར་ཡང་མི་འགྲོ་བར་ཡིད་ཆེས་སོ། །
en: They trust that all phenomena neither come from, nor go, anywhere.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་མཚན་མ་མེད་པ་མངོན་པར་འདུས་མ་བྱས་པར་ཡིད་ཆེས་སོ། །
en: They trust that all phenomena are emptiness, without marks, and unconditioned.

source: ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། མངོན་པར་འདུས་མ་བྱས་པ་དང་། མ་བྱུང་བ་དང་། མཚན་མ་མེད་པ་དང་། མཚན་མ་དང་བྲལ་བར་ཡང་ཡིད་ཆེས་སོ། །
en: They trust that all phenomena are unborn, unconditioned, unarisen, without marks, and free from marks.

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་། ཏིང་ངེ་འཛིན་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་རྣམ་པར་དག་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་སྟོན་པ་རྣམ་པར་དག་པ་ལ་ཡིད་ཆེས་སོ། །
en: They trust in pure discipline, pure absorption, pure insight, and the pure teaching of the wisdom of liberation.

source: བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་དད་པའི་དབང་པོ་ལྷུན་གྱིས་གྲུབ་ནས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏེ།
en: Bodhisattvas become irreversible by effortlessly accomplishing the power of faith;

source: དད་པས་ཐོག་མར་འགྲོའོ། །དེ་བས་ན་ཚུལ་ཁྲིམས་ལ་བདེ་བར་གནས་པས་དད་པ་མི་ཉམས་མི་ལྡོག་སྟེ།
en: guided by faith, they can observe discipline, such that their faith will not decline or be lost.

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལྷུན་གྱིས་གྲུབ་པས་མི་གཡོ་བའི་དད་པ་ལ་གནས་ཏེ་
en: By effortlessly accomplishing the quality of irreversibility, they will have unwavering faith.

source: ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པའི་རྗེས་སུ་དད་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་ངན་པར་ལྟ་བ་ཐམས་ཅད་ཡོངས་སུ་གཅོད་དོ། །
en: They will ripen faith in accordance with the ripening of karmic results, and they will destroy all wrong views.

source: ཆོས་མི་སྤོང་ཞིང་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལས་གཞན་ཡང་མི་ཚོལ་ཏེ།
en: They will not spurn the teachings or seek out any teachers other than the blessed buddhas.

source: རྟག་ཏུ་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་རྗེས་སུ་འཇུག་གོ། །
en: They will always follow the true nature of all phenomena.

source: དགེ་འདུན་གྱི་སྤྱོད་པའི་ཡང་དག་པའི་ལམ་ལ་འཇུག་གོ། །
en: They will follow the genuine path practiced by the saṅgha.

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ལ་གནས་ཤིང་བཟོད་པ་ལྷུན་གྱིས་གྲུབ་པས་དེ་ལྟར་མི་གཡོ། མི་འགྱུར་བའི་དད་པ་དང་། དད་པ་ཁྱད་པར་ཅན་དུ་གྱུར་པས་དད་པའི་དབང་པོ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: Through observing pure discipline and effortlessly accomplishing acceptance, they will attain faith that is unwavering, unchanging, and extraordinary. They are thus said to possess the power of faith.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ལ་ཡང་དག་པར་རྟོག་པ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ལྷུན་གྱིས་གྲུབ་པ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ལ་ཤིན་ཏུ་མཁས་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings accurately contemplate the power of diligence? How do they effortlessly accomplish the power of diligence? How do they become highly skilled in the power of diligence?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བརྩོན་འགྲུས་སྤྱོད་པ་ནི་མི་གཏོང་།
en: Bodhisattva great beings practice diligence endlessly.

source: རྒྱུན་མི་གཅོད་པར་སྒྲིབ་པ་ལྔ་བསལ་བའི་ཕྱིར་བརྩོན་འགྲུས་སྤྱོད་དོ། །
en: They practice diligence without any interruption, in order to dispel the five obscurations.

source: འདི་ལྟར་ཟབ་མོའི་ཆོས་ཉན་པའི་ཕྱིར་བརྩོན་འགྲུས་སྤྱོད་དོ། །
en: They practice diligence in order to hear the profound Dharma in this manner.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཚོལ་བ་ལ་རྒྱུན་མི་ཆད་པས་བརྩོན་འགྲུས་རྩོམ་པ་ལས་ཕྱིར་མི་ལྡོག་གོ། །
en: Bodhisattvas are uninterrupted in their pursuit of the Dharma, never regressing from their diligent pursuits.

source: སྒྲིབ་པའི་ཆོས་ཡོངས་སུ་གཅོད་པའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་ལ་ཞུམ་པ་མེད་དོ། །
en: They are dauntless in their practice of diligence in order to disrupt obscuring phenomena.

source: གཞན་ཡང་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་དང་འཇིག་པའི་ཆོས་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བརྩོན་འགྲུས་སྤྱོད་དོ། །
en: Furthermore, they practice diligence in order to abandon myriad unwholesome and unvirtuous phenomena, as well as all perishable phenomena.

source: གཞན་ཡང་དགེ་བའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་སྤེལ་ཞིང་བསྐྱེད་པའི་ཕྱིར་བརྩོན་འགྲུས་སྤྱོད་དོ། །
en: Furthermore, they practice diligence in order to increase and generate myriad virtuous phenomena.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་གདོན་མི་ཟ་བར་བརྩོན་འགྲུས་ལྷུན་གྱིས་གྲུབ་ཀྱང་
en: Without a doubt, bodhisattvas effortlessly accomplish diligence. However,

source: བརྩོན་འགྲུས་ལ་མི་ཆགས་ཏེ་མཉམ་པའི་བརྩོན་འགྲུས་ལ་འཇུག་གོ། །
en: they do not become attached to it, but rather, engage in diligence with equanimity.

source: དེ་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་ལྷུན་གྱིས་གྲུབ་པས་གང་ཟག་དེ་ཡང་དག་པའི་སྦྱོར་བའི་ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་ནས་བརྩོན་འགྲུས་རབ་ཏུ་སྤྱོད་དོ། །
en: By effortlessly accomplishing irreversible diligence, such people will understand and realize all the qualities of proper practice, thereby mastering diligence.

source: བརྩོན་འགྲུས་ཤིན་ཏུ་བརྩམས་པས་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་སྟེ།
en: By practicing diligence so well, they will not be dependent on others.

source: བརྩོན་འགྲུས་བརྩམས་པ་ལས་ཤེས་རབ་ཀྱི་སྣང་བ་ཐོབ་ཅིང་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་ལྷུན་གྱིས་གྲུབ་པའོ། །
en: Through their practice of diligence, they will achieve the light of insight and effortlessly accomplish the characteristic of irreversibility.

source: དེ་ལྟར་བརྩོན་འགྲུས་ལས་ཕྱིར་མི་ལྡོག་པ་དང་བརྩོན་འགྲུས་ཁྱད་པར་ཅན་དུ་གྱུར་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: As they become irreversible in their diligence and practice such extraordinary diligence, they are said to possess the power of diligence.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་དབང་པོ་ཐོབ་ཅིང་དྲན་པའི་དབང་པོ་ལ་ཤིན་ཏུ་རྣལ་འབྱོར་ཅན་དུ་གྱུར་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings attain the power of mindfulness, and how do they practice the power of mindfulness?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པ་རྩེ་གཅིག་ཏུ་སྡུད་ཅིང་སྦྱིན་པ་བྱིན་ལ་འཇམ་པ་དང་། ཚངས་པར་སྤྱོད་པ་དང་ལྡན་པར་མཐར་ཕྱིན་པར་རྣམ་པར་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་སྲུང་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་སྟོན་པའི་ཕུང་པོ་ཤིན་ཏུ་སྲུང་ངོ་། །
en: Bodhisattva great beings focus one-pointedly on mindfulness, engage in generosity, are gentle, observe pure conduct perfectly, and guard the branch of pure discipline. They carefully guard the branch of absorption, the branch of insight, the branch of liberation, and the branch of teaching the wisdom of liberation.

source: རྟག་ཏུ་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: “They constantly consider and bring to mind the actions of body, speech, and mind.

source: རྟག་ཏུ་མཐར་ཕྱིན་པའི་དངོས་པོ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They constantly consider and bring to mind the topics of perfection.

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་། འགོག་པ་དང་། གནས་པ་དང་། འཕོ་བའི་མཚན་ཉིད་ཀྱི་ཐབས་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They consider and bring to mind the methods related to the characteristics of all phenomena as arising, ceasing, remaining, and transferring.

source: སྡུག་བསྔལ་བ་དང་། ཀུན་འབྱུང་དང་། འགོག་པ་དང་། ལམ་གྱི་བདེན་པ་མཐོང་བ་དང་། ཤེས་པར་བྱ་བ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They see the truths of suffering, origination, cessation, and the path. They consider and bring to mind what is to be understood.

source: དབང་པོ་རྣམས་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་། ལམ་དང་། ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་གྲོལ་བ་དང་། སྙོམས་པར་འཇུག་པའི་སྦྱོར་བ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They consider and bring to mind the powers, strengths, factors of awakening, paths, absorptions, liberations, and the practices of the attainments.

source: ཆོས་ཐམས་ཅད་མི་སྐྱེ་བ་དང་། མི་འགག་པ་དང་། མངོན་པར་འདུས་མ་བྱས་པ་དང་། མ་བྱུང་བ་དང་། བརྗོད་དུ་མེད་པའི་མཚན་ཉིད་དུ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They consider and bring to mind the characteristics of all phenomena as being unborn, unceasing, unconditioned, unarisen, and inexpressible.

source: རྟག་ཏུ་མ་སྐྱེས་པའི་ཤེས་རབ་འཐོབ་པར་བྱ་བ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They constantly consider and bring to mind the attainment of the insight into the unborn.

source: བཟོད་པའི་ཡེ་ཤེས་དང་། སྤོང་བའི་ཡེ་ཤེས་དང་། འགོག་པའི་ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པར་འདོད་པ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They consider and bring to mind the wish to attain the perfect wisdoms of acceptance, abandonment, and cessation.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འདོད་པ་ལ་དྲན་པར་བྱེད།
en: They consider and bring to mind the wish to attain all the perfect qualities of buddhahood.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་སེམས་ལ་གླགས་མི་རྙེད་པར་སེམས་ཤིང་དྲན་པར་བྱེད།
en: They consider and bring to mind how to avoid letting the qualities of the hearers or solitary buddhas influence their minds.

source: རྟག་ཏུ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་དྲན་པར་བྱ་བ་ལ་སེམས་ཤིང་དྲན་པར་བྱེད་དེ།
en: They constantly consider and bring to mind the mindfulness of unimpeded wisdom.

source: ཡང་དག་པར་སེམས་པ་ན་ལུས་ཀྱི་ཆོས་དེ་དག་རིག་པས་དྲན་པ་དེ་ལས་མི་ལྡོག་མི་ཉམས་སོ། །
en: Given such accurate considerations, they come to know the phenomena of the body. Thereby their mindfulness never declines or regresses from that.

source: དེ་ལྟར་རྟོག་པ་ལས་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་ན་གང་ཟག་དེས་དེ་ལྟ་བུའི་སྙིང་པོ་ཡོད་པའི་དྲན་པ་ཁྱད་པར་ཅན་དུ་གྱུར་པས་དྲན་པའི་དབང་པོ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: Due to these contemplations, they become independent from others. As this occurs, such people attain a superior mindfulness that is meaningful in these ways. Thus, they are said to possess the power of mindfulness.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཐོབ་ཅིང་ཏིང་ངེ་འཛིན་གྱི་སྦྱོར་བ་ཐོབ་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings attain the power of absorption, and how do they attain the practices of absorption?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཕགས་པའི་ས་ལ་གནས་པ་ན་རྟག་ཏུ་ཏིང་ངེ་འཛིན་སྤྱོད་ཀྱང་ཏིང་ངེ་འཛིན་ལ་མི་གནས། ཏིང་ངེ་འཛིན་ལ་མི་ཆགས་ཏེ།
en: When bodhisattva great beings dwell on the level of the noble ones, even though they practice absorption, they never dwell in absorption or become attached to absorption.

source: ཏིང་ངེ་འཛིན་གྱི་མཚན་ཉིད་ལ་ཤིན་ཏུ་འཇུག་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྦྱོར་བ་ལ་ཤིན་ཏུ་ཐོབ་པ་དང་། ཏིང་ངེ་འཛིན་ཤིན་ཏུ་བསྐྱེད་པ་དང་། མི་དམིགས་པའི་ཏིང་ངེ་འཛིན་སྤྱོད་པས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྒོ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཏིང་ངེ་འཛིན་དུ་འཇུག་པ་ལ་མཁས་པ་དང་། ཏིང་ངེ་འཛིན་གནས་པ་ལ་མཁས་པ་དང་། ཏིང་ངེ་འཛིན་ལས་ལྡང་བ་ལ་མཁས་པ་དང་། ཏིང་ངེ་འཛིན་ལ་མི་རྟེན་པ་དང་། དམིགས་པའི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། དེ་བཞིན་ཉིད་ཀྱི་མཚན་ཉིད་དམིགས་པ་ལ་ཡང་མཁས་པའོ། །
en: By thoroughly engaging in the characteristics of absorption—and by thoroughly attaining the practices of absorption, thoroughly generating the absorptions, and practicing absorption that is without observation— they become skilled in the gateways of all absorptions, skilled in entering absorption, skilled in abiding in absorption, skilled in leaving absorption, skilled in not resting in absorption, skilled in the characteristics of observation, and skilled in observing the characteristics of suchness .

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རོ་ལའང་མཁས་ཏེ། ཏིང་ངེ་འཛིན་ལ་དབང་དུ་གྱུར་པས་
en: Because they are skilled in the experience of all absorptions and have power over absorption,

source: གཞན་གྱི་དྲིང་ལ་མི་འཇོག་ཅིང་ཏིང་ངེ་འཛིན་གྱི་དབང་དུ་མི་འགྱུར་ཏེ།
en: they are not dependent on others, and they do not fall under the power of absorption. Rather,

source: ཏིང་ངེ་འཛིན་ལས་དབང་དང་མཐུ་ཡང་ཐོབ་བོ། །
en: they gain power and strength from absorption.

source: ཏིང་ངེ་འཛིན་ལས་དཀའ་བ་ཅུང་ཟད་ཀྱང་མེད་པར་འདོད་པ་བཞིན་དུ་གང་ཟག་དེས་དེ་ལྟར་ཏིང་ངེ་འཛིན་ཁྱད་པར་ཅན་དུ་གྱུར་པས་ན། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཐོབ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་སྦྱོར་བ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Among absorptions, there are none that are difficult or deficient; they are accomplished precisely according to their wishes. People with such extraordinary absorptions are said to have attained the power of absorption and the practice of the power of absorption.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་དབང་པོ་དང་ལྡན་པ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྦྱོར་བ་ཐོབ་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings attain the power of insight, and how do they practice the power of insight?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་དབང་པོ་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པ་ནི་འདི་ལྟ་སྟེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྡུག་བསྔལ་རྣམས་འགོག་པར་འགྱུར་རོ། །
en: Bodhisattva great beings who understand and realize the power of insight will correctly quell all suffering.

source: གང་ཟག་དེས་དེ་ལྟར་ཤེས་རབ་ཀྱི་གནས་དང་ཤེས་རབ་ཀྱི་ལས་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པས་
en: Since such people understand and realize the locus and activity of insight,

source: རྟོག་པ་ལས་དབེན་ཏེ་རྟོག་པ་བཏང་སྙོམས་སུ་གྱུར་པས་
en: they disengage from concepts and abandon concepts, whereby

source: མྱ་ངན་ལས་འདའ་བ་ལ་རྗེས་སུ་གཞོལ་བའི་ཤེས་རབ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: they will perfect the insight that leads to nirvāṇa.

source: ཤེས་རབ་ཀྱི་དབང་པོ་ལྷུན་གྱིས་གྲུབ་པས་ཁམས་གསུམ་འདི་དག་ནི་ཀུན་གཅིག་ཏུ་འབར་བར་ཤེས་སོ། །
en: By effortlessly accomplishing the power of insight, they understand the three realms to be entirely ablaze.

source: ཁམས་གསུམ་འདི་དག་ནི་ཐམས་ཅད་ཀྱང་སྡུག་བསྔལ་བ་སྟེ་ཤེས་རབ་དེ་ལྟ་བུས་ན་ཁམས་གསུམ་ན་མི་གནས་སོ། །
en: With insight into the fact that the three realms are all suffering, they do not abide in the three realms.

source: གང་ཟག་དེས་དེ་ལྟར་ཁམས་གསུམ་འདི་དག་ནི་ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་དེ། མཚན་མ་མེད་པ། སྨོན་པ་མེད་པ། མ་སྐྱེས་པ། མངོན་པར་འདུས་མ་བྱས་པ། མ་བྱུང་བ། འདུས་བྱས་ཀྱི་ཆོས་ཀྱི་ལམ་ལས་འདས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པར་རྟོག་པས་
en: By realizing the three realms to be emptiness, without marks, without wishes, unborn, unconditioned, unarisen, beyond the way of conditioned phenomena, and endowed with the perfect qualities of buddhahood—

source: མགོའི་ཐོད་ལ་མེ་འབར་བ་བཞིན་དུ་བརྩོན་འགྲུས་ཤིན་ཏུ་རྩོམ་མོ། །
en: they will engage diligently as if their hair were on fire.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཤེས་རབ་ནི་གཞིག་ནུས་པ་མེད་དེ།
en: The insight of these bodhisattvas is indestructible.

source: ཤེས་རབ་དེ་ལྟ་བུ་ཁོང་དུ་ཆུད་པས་ཁམས་གསུམ་ལས་ཤིན་ཏུ་འདས་ཏེ་ཁམས་གསུམ་གྱི་དངོས་པོ་ལ་མི་གནས་སོ། །
en: By mastering such insight, they transcend the three realms and do not abide in the existence of the three realms.

source: འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཅད་དེ། རྣམ་པར་ཆགས་པ་དང་བཅིང་བའི་ཆོས་ལ་མི་གནས་སོ། །
en: They eliminate all conditioned phenomena and do not abide in any phenomena of attachment and bondage.

source: འདོད་པའི་རྣམ་པ་ལྔ་ལ་སེམས་ཀྱིས་སྐྱོ་ཞིང་གཟུགས་ཡོད་པ་དང་གཟུགས་མེད་པའི་ཁམས་ལ་མི་གནས་པས་
en: They become weary of the five objects of desire and avoid both the form and formless realms. Thereby
